list_1 = ['+9', 'примерно в', '23', 'часа', '8', 'минут', '03', '05', 'секунд', 'температура', 'воздуха', 'была',
          '5', 'градусов Цельсия', 'темп', 'воды', '+2.0', 'градусов', 'Цельсия', '-2', '11']
list_2 = ['примерно в', '23', 'часа', '8', 'минут', '03', 'секунд', 'температура', 'воздуха', 'была', '-5',
          'градусов Цельсия', 'темп', 'воды', '+12', 'градусов', 'Цельсия']
list_3 = ['+9', 'примерно в', '23', 'часа', '8', 'минут', '03', '05', 'секунд', 'температура', 'воздуха', 'была',
          '5', 'градусов Цельсия', 'темп', 'воды', '+2.0', 'градусов', 'Цельсия', '-2', '11']

for idx_lst, lst in enumerate([list_1, list_2, list_3]):
    print(f'{idx_lst}. Исходный список:', lst)
    print('id до добавления кавычек:', id(lst))

    i = 0
    while i < len(lst):
        if ((lst[i][0] == '-' or lst[i][0] == '+') and lst[i][1:].isdigit()) or lst[i].isdigit():
            lst.insert(i, '"')
            lst.insert(i + 2, '"')
            i += 3
        else:
            i += 1

    print('    0. Новый список + добавление элементов-кавычек:', lst)
    print('id после добавления кавычек:', id(lst))

