w = ['"', '+09', '"', 'примерно в', '"', '23', '"', 'часа', '"', '08', '"', 'минут', '"',
                              '03', '"', '"', '05', '"', 'секунд', 'температура', 'воздуха', 'была', '"', '05', '"',
                              'градусов Цельсия', 'темп', 'воды', '+2.0', 'градусов', 'Цельсия', '"', '-02', '"', '"',
                              '11', '"']
s = ''
i = 0
while i <= len(w) - 1:
    if i == len(w) - 1:
        s += w[i]
        i += 1
    elif w[i] == '"':
        if i + 2 == len(w) - 1:
            s += f'{w[i]}{w[i + 1]}{w[i + 2]}'
            i += 3
        else:
            s += f'{w[i]}{w[i + 1]}{w[i + 2]}_'
            i += 3
    else:
        s += f'{w[i]}_'
        i += 1

print(s)
